esden/stm32cube-database/db/mcu/memory/STM32_DIE4B0_512_2048.xml
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<rzone xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="0.2.0" xs:noNamespaceSchemaLocation="AMC_rzone.xsd">

  <device Dname="STM32WBA-2M" Dvendor="STMicroelectronics:13" info="ARM Cortex-M33, 512 KB RAM, 2 MB FLASH">
    <package info="STMicroelectronics STM32WBA Series Device Support" name="STM32WBAxx_DFP" url="http://www.st.com/" vendor="STMicroelectronics" version="0.0.1-dev1"/>
    <processor Dclock="10000000" Dcore="ARM Cortex-M33" DcoreVersion="r0p4_p1" Ddsp="DSP" Dendian="Little-endian" Dfpu="SP_FPU" Dmpu="MPU" Dtz="TZ" DnumInterrupts="82"  DnumMpuRegions="16" DnumSecMpuRegions="8" DnumSauRegions="8"/>
  </device>

  <resources>

    <sau_init>
      <region start="0x08000000" size="0x04000000" security="n" info="Non-Secure Code"/>
      <region start="0x20000000" size="0x10000000" security="n" info="Non-Secure RAM"/>
      <region start="0x40000000" size="0x10000000" security="n" info="Non-Secure Peripherals"/>
    </sau_init>

    <memories>
      <memory access="rx" info="Flash memory" name="Flash_NS" security="n" size="0x00200000" start="0x08000000" type="ROM"/>

      <memory access="rx" info="Flash memory" name="Flash_S" physical="0x08000000" security="c" size="0x00200000" start="0x0C000000" type="ROM"/>

      <memory access="rwx" info="SRAM1" name="SRAM1_NS" security="n" size="0x00070000" start="0x20000000" type="RAM"/>
      <memory access="rwx" info="SRAM2" name="SRAM2_NS" security="n" size="0x00010000" start="0x20070000" type="RAM"/>
      <memory access="rwx" info="RX/TX_RAM_Radio" name="RX/TX_RAM_NS" security="n" size="0x00004000" start="0x48028000" type="RAM"/>

      <memory access="rwx" info="SRAM1" name="SRAM1_S" physical="0x20000000" security="c" size="0x00070000" start="0x30000000" type="RAM"/>
      <memory access="rwx" info="SRAM2" name="SRAM2_S" physical="0x20070000" security="c" size="0x00010000" start="0x30070000" type="RAM"/>
      <memory access="rwx" info="RX/TX_RAM_Radio" name="RX/TX_RAM_S" physical="0x48028000" security="c" size="0x00004000" start="0x58028000" type="RAM"/>

      <mpc blk_size="0x200" sblk_size="0x20" info="SRAM1" name="GTZC1_MPCBB1" size="0x00070000" start="0x20000000" type="sp"/>
      <mpc blk_size="0x200" sblk_size="0x20" info="SRAM2" name="GTZC1_MPCBB2" size="0x00010000" start="0x20070000" type="sp"/>
      <mpc blk_size="0x200" sblk_size="0x20" info="RX/TX_RAM_Radio" name="GTZC1_MPCBB6" size="0x00004000" start="0x48028000" type="sp"/>

      <mpc blk_size="0x2000" info="Flash Bank1" name="FLASH_BB1" size="0x00200000" start="0x08000000" type="sp"/>

      <mpcwm sections="1" granularity="0x00002000" info="Flash Bank1" name="FLASH_WM1" size="0x00200000" start="0x08000000" type="s"/>
    </memories>

   </resources>

</rzone>
